glcloud/keil_v5/ARM/PACK/.Web/NXP.MKE15Z4_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <name>MKE15Z4_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for MKE15Z4</description>
  <url>http://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version="11.0.0">NXP CMSIS packs based on MCUXpresso SDK 2.5.0</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <taxonomy>
    <description Cclass="Device" Cgroup="SDK Project Template">NXP MCUXpresso SDK RTE Device Project Template</description>
    <description Cclass="Device" Cgroup="SDK Utilities">NXP MCUXpresso SDK Utilities</description>
    <description Cclass="Device" Cgroup="SDK Drivers">NXP MCUXpresso SDK Peripheral Drivers</description>
    <description Cclass="CMSIS Driver">NXP MCUXpresso SDK Peripheral CMSIS Drivers</description>
    <description Cclass="Board Support" Cgroup="SDK Project Template">NXP MCUXpresso SDK Project Template</description>
    <description Cclass="Device" Cgroup="Startup">NXP MCUXpresso SDK Start up</description>
  </taxonomy>
  <devices>
    <family Dfamily="MKE15Z4" Dvendor="NXP:11">
      <description>KE1xZ MCUs are based on the ARM Cortex-M0+ core, running up to 72 MHz. These MCUs support up to 256 KB flash, 32 KB RAM, and a complete set of analog/digital features. The robust TSI module provides a high level of stability and accuracy to any HMI system. The 1-Msps ADC and FlexTimer modules provides a perfect solution for BLDC motor-control systems. The MSCAN IP is ideal for the CAN node control and auto after car market applications.</description>
      <device Dname="MKE15Z64xxx4">
        <processor Dcore="Cortex-M0+" Dfpu="NO_FPU" Dendian="Little-endian" Dclock="48000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MKE15Z64xxx4_flash.icf"/>
        </environment>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x010000" access="rx" default="1" startup="1"/>
        <memory name="SRAM" start="0x1ffff800" size="0x2000" access="rw" default="1"/>
        <algorithm name="arm/MKE1x_P64_1KB_SEC.FLM" start="0x00000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x000017e2" default="1"/>
        <debug svd="MKE15Z4.xml"/>
        <variant Dvariant="MKE15Z64VLF4">
          <compile header="fsl_device_registers.h" define="CPU_MKE15Z64VLF4"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKE15Z64VLF4/MKE15Z64xxx4_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKE15Z64VLD4">
          <compile header="fsl_device_registers.h" define="CPU_MKE15Z64VLD4"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKE15Z64VLD4/MKE15Z64xxx4_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
      <device Dname="MKE15Z32xxx4">
        <processor Dcore="Cortex-M0+" Dfpu="NO_FPU" Dendian="Little-endian" Dclock="48000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MKE15Z32xxx4_flash.icf"/>
        </environment>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x8000" access="rx" default="1" startup="1"/>
        <memory name="SRAM" start="0x1ffffc00" size="0x1000" access="rw" default="1"/>
        <algorithm name="arm/MKE1x_P64_1KB_SEC.FLM" start="0x00000000" size="0x00008000" RAMstart="0x20000000" RAMsize="0x00000c00" default="1"/>
        <debug svd="MKE15Z4.xml"/>
        <variant Dvariant="MKE15Z32VLF4">
          <compile header="fsl_device_registers.h" define="CPU_MKE15Z32VLF4"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKE15Z32VLF4/MKE15Z32xxx4_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKE15Z32VLD4">
          <compile header="fsl_device_registers.h" define="CPU_MKE15Z32VLD4"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKE15Z32VLD4/MKE15Z32xxx4_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="cond_MCUXpressoConfigTools">
      <accept Dname="MKE15Z64???4" Dvendor="NXP:11"/>
      <accept Dname="MKE15Z32???4" Dvendor="NXP:11"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="device.MKE15Z4">
      <accept Dname="MKE15Z64???4" Dvendor="NXP:11"/>
      <accept Dname="MKE15Z32???4" Dvendor="NXP:11"/>
    </condition>
    <condition id="device.MKE15Z4_AND_utility.debug_console">
      <accept Dname="MKE15Z64???4" Dvendor="NXP:11"/>
      <accept Dname="MKE15Z32???4" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
    </condition>
    <condition id="device.MKE15Z4_AND_driver.common">
      <accept Dname="MKE15Z64???4" Dvendor="NXP:11"/>
      <accept Dname="MKE15Z32???4" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.MKE15Z4_AND_component.lists_AND_utility.debug_console">
      <accept Dname="MKE15Z64???4" Dvendor="NXP:11"/>
      <accept Dname="MKE15Z32???4" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
    </condition>
    <condition id="device.MKE15Z4_AND_driver.lpuart">
      <accept Dname="MKE15Z64???4" Dvendor="NXP:11"/>
      <accept Dname="MKE15Z32???4" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
    </condition>
    <condition id="device.MKE15Z4_AND_component.lpuart_adapter_AND_driver.common">
      <accept Dname="MKE15Z64???4" Dvendor="NXP:11"/>
      <accept Dname="MKE15Z32???4" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
    </condition>
    <condition id="device.MKE15Z4_AND_component.serial_manager_AND_driver.common">
      <accept Dname="MKE15Z64???4" Dvendor="NXP:11"/>
      <accept Dname="MKE15Z32???4" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.MKE15Z4_AND_CMSIS_Driver_Include.USART_AND_RTE_Device_AND_driver.lpuart">
      <accept Dname="MKE15Z64???4" Dvendor="NXP:11"/>
      <accept Dname="MKE15Z32???4" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.MKE15Z4_AND_CMSIS_Driver_Include.SPI_AND_RTE_Device_AND_driver.lpspi">
      <accept Dname="MKE15Z64???4" Dvendor="NXP:11"/>
      <accept Dname="MKE15Z32???4" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.2.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.MKE15Z4_AND_CMSIS_Driver_Include.I2C_AND_RTE_Device_AND_driver.lpi2c">
      <accept Dname="MKE15Z64???4" Dvendor="NXP:11"/>
      <accept Dname="MKE15Z32???4" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpi2c"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.MKE15Z4_AND_device.MKE15Z4_CMSIS_AND_driver.clock">
      <accept Dname="MKE15Z64???4" Dvendor="NXP:11"/>
      <accept Dname="MKE15Z32???4" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="Startup" Csub="MKE15Z4_startup"/>
    </condition>
    <condition id="device.MKE15Z4_AND_component.lpuart_adapter_AND_component.serial_manager_uart_AND_device.MKE15Z4_startup_AND_driver.adc12_AND_driver.clock_AND_driver.common_AND_driver.gpio_AND_driver.lpi2c_AND_driver.lpuart_AND_driver.port_AND_driver.smc_AND_utility.debug_console">
      <accept Dname="MKE15Z64???4" Dvendor="NXP:11"/>
      <accept Dname="MKE15Z32???4" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="port"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="smc"/>
      <require Cclass="Device" Cgroup="Startup" Csub="MKE15Z4_startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpi2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="adc12"/>
    </condition>
    <condition id="device.MKE15Z4_AND_CMSIS_Include_core_cm0plus">
      <accept Dname="MKE15Z64???4" Dvendor="NXP:11"/>
      <accept Dname="MKE15Z32???4" Dvendor="NXP:11"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
